package day0331;
//  변수 (Variable)
//  "변"하는 "수"
// 변수란, 우리가 특정 공간에 어떤 값이 들어갈 것이고, 그 공간의 이름은 무엇이다 라고 지정을 해주면
// 그 공간이 우리가 이름을 부를 때마다 호출돼서 그 안에 값을 자유롭게 변경하거나 아니면 저장된 값을
// 보내주는 공간이 된다.

// 변수를 사용할 때에는
// 선언과 초기화를 거쳐야 사용 가능하다.
// 선언(declaration): 해당 변수의 이름과 어떤 종류의 값을 저장 가능한지 저장한다.
// 초기화(initialization): 해당 변수에 맨 처음 값을 지정한다.

// 변수의 선언과 초기화 방법
// 선언)
// 데이터타입 변수이름
// 1. 데이터타입이란, 해당 변수가 어떤 종류의 값을 가질 수 있는지를 지정해주는 것이다.
//    자료형이라고도 한다.
// 2. 변수이름은 소문자로 시작하는 명사이다.

// 초기화) 
// 변수이름  = 값
// 초기화 시에 입력되는 값은 반드시 데이터타입에 맞는 값이어야만 한다.
// 또한 초기화는 우리가 할당, 저장 이라고도 부르는데 모두다 맞는 말이다.

public class Ex04Variable {

}
