package day0331;
// 자료형(Data types)
// 데이터타입이란 해당 변수 혹은 상수가 어떠한 값을 가질 수 있는지를 규정하는 것이다.
// 데이터타입에는 두 가지 종류가 있는데
// 기본형 데이터타입과 참조형 데이터타입 두 가지가 존재한다.
// 기본형 데이터타입: 값이 이진법으로 변환돼서 해당 공간에 직접 저장이 됨.
//               byte short int long float double char boolean 총 8가지 데이터타입이 존재함.

// 참조형 데이터타입: 실제 값은 다른 공간에 저장이 되고 그 공간에 주소값이 해당 공간에 저장이 됨.
//                클래스형, 배열형, 인터페이스형까지 총 3가지 종류의 데이터타입이 존재함.


// 우리는 지금부터 기본형 데이터타입부터 차근차근 배워나갈 것이다.
// 기본형 데이터타입에는 크게
// 정수형, 실수형, 문자형, 논리형 4가지 종류의 데이터타입이 존재한다.

// 정수형 : 정수란? 소숫점이 존재하지 않는, 명확하게 떨어지는 숫자
//         byte, short, int, long 4가지 데이터타입이 정수형 기본 데이터타입이 된다.

// 실수형 : 실수란? 소숫점이 존재하는 숫자.
//         float, double 2가지 데이터타입이 실수형 기본 데이터타입이 된다.

// 문자형 : 문자란? ASCII 테이블이라는 특수한 문자표값을 따르는 글자들을 말한다.
//char가 문자형 기본 데이터타입이 된다. 

//논리형 : 논리형은 true/false 라는 2가지 값만 가지는 특수한 데이터타입이다.
//boolean이 논리형 기본 데이터타입이 된다. 


public class Ex06DataTypes {

}
