package day0331;
// 연산자 (Operator)
// 연산자란, 수학적 기호에 프로그래밍 기능을 정의해놓고 
// 우리가 해당 기호를 쓰면 그 기능이 실행되는데 해당 기호를 우리가 연산자라고 부른다.
// 연산자의 경우, 한글자 일때도 있지만, 두글자 이상으로 이루어질 때도 있는데
// 이때에는 반드시 띄어쓰기가 없이 붙여서 써야 정상적으로 작동이 된다.

// 연산자에는 다음과 같은 종류가 있다.
// 1. 산술연산자 : 사칙연산을 포함한 간단한 숫자의 계산을 담당한다.
// 2. 할당연산자 : 오른쪽 값을 왼쪽 공간에 연산 후에 할당한다.
// 3. 비교연산자 : 2개의 값을 비교하여 결과값을 boolean의 형태로 나타낸다.
// 4. 논리연산자 : 1개 이상의 boolean 값에 대한 연산을 한다.
// 5. 비트연산자 : 비트(2진법 숫자)에 대한 다양한 연산을 한다.

// 이중에서 우리는 비트연산자를 제외한 나머지 연산자들만 배우게 된다.
// 비트연산자의 경우 난이도가 있을 뿐더러, 자바에서는 잘 사용을 안하게 된다.
// 왜냐하면 비트연산자는 속도가 매우 빠르다 라는 장점이 있는데
// 자바는 태생적 한계 때문에 속도가 빠를 수 없는 언어이다.
// 비트 연산자가 주로 사용되는 분야는 네트워크나 이미지 처리 분야가 있다.
// 두 분야 모두 속도가 중요한 분야이기 때문에 비트연산자가 중요하다.

public class Ex12Operator {

}
